Revit 2018 API
Document.NewElectricalSystem Method (ICollection<ElementId>, ElectricalSystemType)
Creates a new MEP Electrical System element from a set of electrical components.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.0)
Syntax
C#
[ObsoleteAttribute("This method is obsolete in Revit 2018. Please use ElectricalSystem.Create() instead.")]
public ElectricalSystem NewElectricalSystem(
	ICollection<ElementId> electComponents,
	ElectricalSystemType elecSysType
)
Visual Basic
<ObsoleteAttribute("This method is obsolete in Revit 2018. Please use ElectricalSystem.Create() instead.")> _
Public Function NewElectricalSystem ( _
	electComponents As ICollection(Of ElementId), _
	elecSysType As ElectricalSystemType _
) As ElectricalSystem
Visual C++
[ObsoleteAttribute(L"This method is obsolete in Revit 2018. Please use ElectricalSystem.Create() instead.")]
public:
ElectricalSystem^ NewElectricalSystem(
	ICollection<ElementId^>^ electComponents,
	ElectricalSystemType elecSysType
)
Parameters
electComponents
Type: System.Collections.Generic.ICollection<ElementId>
The electrical components in this system.
elecSysType
Type: Autodesk.Revit.DB.Electrical.ElectricalSystemType
The System Type of electrical system.
Return Value
 If successful a new MEP Electrical System element within the project, otherwise null.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  Thrown when the specified parameter Value is null.
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  Thrown when the elecSysType parameter Value is out of the range of ElectricalSystemType.
Autodesk.Revit.Exceptions.InvalidOperationException |  Thrown when the electrical system cannot be created by these input electrical components.
See Also
Document Class
NewElectricalSystem Overload
Autodesk.Revit.Creation Namespace